aom
aribb24
brotli
ca-certificates
cairo
cjson
dav1d
fd
ffmpeg-full
flac
fontconfig
freetype
frei0r
fribidi
fzf
gdk-pixbuf
gettext
ggml
ghostscript
giflib
glib
gmp
gnupg
gnutls
gpgme
gpgmepp
graphite2
harfbuzz
highway
icu4c@78
imagemagick-full
imath
jbig2dec
jpeg-turbo
jpeg-xl
jq
lame
lazygit
leptonica
libarchive
libass
libassuan
libb2
libbluray
libdatrie
libde265
libdeflate
libevent
libgcrypt
libgpg-error
libheif
libidn
libidn2
libksba
liblqr
libmicrohttpd
libnghttp2
libogg
libomp
libplacebo
libpng
libraw
librist
librsvg
libsamplerate
libsndfile
libsodium
libsoxr
libssh
libtasn1
libthai
libtiff
libtool
libudfread
libultrahdr
libunibreak
libunistring
libusb
libvidstab
libvmaf
libvorbis
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libzip
little-cms2
lz4
lzo
m4
mbedtls@3
mpg123
ncurses
nettle
npth
nspr
nss
oniguruma
opencore-amr
openexr
openjpeg
openjph
openssl@3
opus
p11-kit
pango
pcre2
pinentry
pixman
poppler
rav1e
readline
resvg
ripgrep
rubberband
rustup
sdl2
sevenzip
shaderc
snappy
speex
srt
svt-av1
tesseract
theora
tmux
unbound
utf8proc
vulkan-headers
vulkan-loader
webp
whisper-cpp
x264
x265
xorgproto
xvid
xz
yazi
zeromq
zimg
zoxide
zstd
adguard
alt-tab
bitwarden
discord
font-symbols-only-nerd-font
ghostty
git-credential-manager
microsoft-edge
obsidian
rectangle-pro
spotify
stats
zed
